Revit 2027 API
RebarConstrainedHandle.GetHandleName Method
 Gets the name of the handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetHandleName()
Public Function GetHandleName As String
public:
String^ GetHandleName()
member GetHandleName : unit -> string
Return Value
String
 Returns the name of the handle. In case of handles of CustomHandle type it can return null if the server that defined them is not registered.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstrainedHandle is no longer valid.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace